tests/data/payment_gateway/api/test_refund_success.json

{
  "_links": {
    "void": {
      "method": "POST",
      "href": "/pts/v2/refunds/111111111/voids"
    },
    "self": {
      "method": "GET",
      "href": "/pts/v2/refunds/111111111"
    }
  },
  "clientReferenceInformation": {
    "code": "TC50171_3"
  },
  "id": "111111111",
  "orderInformation": {
    "amountDetails": {
      "currency": "USD"
    }
  },
  "processorInformation": {
    "approvalCode": "888888",
    "responseCode": "100"
  },
  "reconciliationId": "73747272D45A0W07",
  "refundAmountDetails": {
    "currency": "USD",
    "refundAmount": "10.00"
  },
  "status": "PENDING",
  "submitTimeUtc": "2022-06-08T19:29:22Z"
}
